from django.http import HttpResponse
from django.shortcuts import render
from goods.models import Categories
# Create your views here.
def index(request):

    
    context = {
        'title':'Home - Главная',
        'content': 'Магазин мебели HOME',
        'categories': Categories
    }
    
    return render(request, 'main/index.html',context)


def about(request):
    context = {
        'title':'Home - О нас',
        'content': 'О нас',
        'text_on_page':'Добро пожаловать в Home – ваш источник качественной мебели для создания уютного и стильного интерьера! Мы являемся ведущими экспертами в области мебельного дизайна и предлагаем широкий ассортимент товаров, отвечающих самым высоким стандартам качества и функциональности. Наша миссия - помочь вам сделать ваш дом местом, где вы с удовольствием проводите время, и где каждая деталь отражает ваш уникальный стиль и вкус. Мы стремимся к тому, чтобы каждый клиент получил не только превосходную мебель, но и безупречный сервис. В Home мы гордимся нашей командой опытных профессионалов, которые всегда готовы помочь вам с выбором и советом. Наша цель - сделать процесс покупки мебели легким, приятным и вдохновляющим. Благодарим вас за то, что выбрали нас. Мы надеемся, что ваше путешествие по миру мебели с Home будет приятным и полезным! С любовью, команда Home.'
    }
    
    return render(request, 'main/about.html',context)
